ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_CAN.cpp
#define C2TFI3 (*(volatile unsigned long *)0x40048050)
#define CAN2TFI3 C2TFI3
#define C2TFI3_OFFSET 0x50
#define CAN2TFI3_OFFSET C2TFI3_OFFSET
#define C2TFI3_PRIO_MASK 0xFF
#define CAN2TFI3_PRIO_MASK C2TFI3_PRIO_MASK
#define C2TFI3_PRIO_BIT 0
#define CAN2TFI3_PRIO_BIT C2TFI3_PRIO_BIT
#define C2TFI3_DLC_MASK 0xF0000
#define CAN2TFI3_DLC_MASK C2TFI3_DLC_MASK
#define C2TFI3_DLC_BIT 16
#define CAN2TFI3_DLC_BIT C2TFI3_DLC_BIT
#define C2TFI3_RTR_MASK 0x40000000
#define CAN2TFI3_RTR_MASK C2TFI3_RTR_MASK
#define C2TFI3_RTR 0x40000000
#define CAN2TFI3_RTR C2TFI3_RTR
#define C2TFI3_RTR_BIT 30
#define CAN2TFI3_RTR_BIT C2TFI3_RTR_BIT
#define C2TFI3_FF_MASK 0x80000000
#define CAN2TFI3_FF_MASK C2TFI3_FF_MASK
#define C2TFI3_FF 0x80000000
#define CAN2TFI3_FF C2TFI3_FF
#define C2TFI3_FF_BIT 31
#define CAN2TFI3_FF_BIT C2TFI3_FF_BIT

#define C2TID3 (*(volatile unsigned long *)0x40048054)
#define CAN2TID3 C2TID3
#define C2TID3_OFFSET 0x54
#define CAN2TID3_OFFSET C2TID3_OFFSET
#define C2TID3_ID_MASK 0x7FF
#define CAN2TID3_ID_MASK C2TID3_ID_MASK
#define C2TID3_ID_BIT 0
#define CAN2TID3_ID_BIT C2TID3_ID_BIT

#define C2TDA3 (*(volatile unsigned long *)0x40048058)
#define CAN2TDA3 C2TDA3
#define C2TDA3_OFFSET 0x58
#define CAN2TDA3_OFFSET C2TDA3_OFFSET
#define C2TDA3_Data_1_MASK 0xFF
#define CAN2TDA3_Data_1_MASK C2TDA3_Data_1_MASK
#define C2TDA3_Data_1_BIT 0
#define CAN2TDA3_Data_1_BIT C2TDA3_Data_1_BIT
#define C2TDA3_Data_2_MASK 0xFF00
#define CAN2TDA3_Data_2_MASK C2TDA3_Data_2_MASK
#define C2TDA3_Data_2_BIT 8
#define CAN2TDA3_Data_2_BIT C2TDA3_Data_2_BIT
#define C2TDA3_Data_3_MASK 0xFF0000
#define CAN2TDA3_Data_3_MASK C2TDA3_Data_3_MASK
#define C2TDA3_Data_3_BIT 16
#define CAN2TDA3_Data_3_BIT C2TDA3_Data_3_BIT
#define C2TDA3_Data_4_MASK 0xFF000000
#define CAN2TDA3_Data_4_MASK C2TDA3_Data_4_MASK
#define C2TDA3_Data_4_BIT 24
#define CAN2TDA3_Data_4_BIT C2TDA3_Data_4_BIT

#define C2TDB3 (*(volatile unsigned long *)0x4004805C)
#define CAN2TDB3 C2TDB3
#define C2TDB3_OFFSET 0x5C
#define CAN2TDB3_OFFSET C2TDB3_OFFSET
#define C2TDB3_Data_5_MASK 0xFF
#define CAN2TDB3_Data_5_MASK C2TDB3_Data_5_MASK
#define C2TDB3_Data_5_BIT 0
#define CAN2TDB3_Data_5_BIT C2TDB3_Data_5_BIT
#define C2TDB3_Data_6_MASK 0xFF00
#define CAN2TDB3_Data_6_MASK C2TDB3_Data_6_MASK
#define C2TDB3_Data_6_BIT 8
#define CAN2TDB3_Data_6_BIT C2TDB3_Data_6_BIT
#define C2TDB3_Data_7_MASK 0xFF0000
#define CAN2TDB3_Data_7_MASK C2TDB3_Data_7_MASK
#define C2TDB3_Data_7_BIT 16
#define CAN2TDB3_Data_7_BIT C2TDB3_Data_7_BIT
#define C2TDB3_Data_8_MASK 0xFF000000
#define CAN2TDB3_Data_8_MASK C2TDB3_Data_8_MASK
#define C2TDB3_Data_8_BIT 24
#define CAN2TDB3_Data_8_BIT C2TDB3_Data_8_BIT

struct LPC17_Can_Filter {
    uint32_t *matchFilters;
    uint32_t matchFiltersSize;

    uint32_t *lowerBoundFilters;
    uint32_t *upperBoundFilters;
    uint32_t groupFiltersSize;
};

typedef struct {
    uint32_t timeStampL;
    uint32_t timeStampH;

    uint32_t msgId;

    bool extendedId;
    bool remoteTransmissionRequest;

    uint32_t dataA;
    uint32_t dataB;

    int32_t length;

} LPC17_Can_Message;

struct CanState {
    int32_t controllerIndex;

    const TinyCLR_Can_Controller* provider;

    LPC17_Can_Message *canRxMessagesFifo;

    TinyCLR_Can_ErrorReceivedHandler   errorEventHandler;
    TinyCLR_Can_MessageReceivedHandler    messageReceivedEventHandler;

    int32_t can_rx_count;
    int32_t can_rx_in;
    int32_t can_rx_out;

    size_t can_rxBufferSize;
    size_t can_txBufferSize;

    uint32_t baudrate;

    LPC17_Can_Filter canDataFilter;

    uint16_t initializeCount;

    bool enable;
};

#define CAN_TX_PIN 0
#define CAN_RX_PIN 1

static const LPC17_Gpio_Pin canPins[][2] = LPC17_CAN_PINS;

static CanState canStates[TOTAL_CAN_CONTROLLERS];

static TinyCLR_Can_Controller canControllers[TOTAL_CAN_CONTROLLERS];
static TinyCLR_Api_Info canApi[TOTAL_CAN_CONTROLLERS];

void CAN_DisableExplicitFilters(int32_t controllerIndex) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    auto state = &canStates[controllerIndex];

    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    if (state->canDataFilter.matchFiltersSize && state->canDataFilter.matchFilters != nullptr) {
        memoryProvider->Free(memoryProvider, state->canDataFilter.matchFilters);

        state->canDataFilter.matchFiltersSize = 0;
    }
}

void CAN_DisableGroupFilters(int32_t controllerIndex) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    auto state = &canStates[controllerIndex];

    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    if (state->canDataFilter.groupFiltersSize) {
        if (state->canDataFilter.lowerBoundFilters != nullptr)
            memoryProvider->Free(memoryProvider, state->canDataFilter.lowerBoundFilters);

        if (state->canDataFilter.upperBoundFilters != nullptr)
            memoryProvider->Free(memoryProvider, state->canDataFilter.upperBoundFilters);

        state->canDataFilter.groupFiltersSize = 0;
    }
}

/******************************************************************************
** Function name:        CAN_SetACCF_Lookup
**
** Descriptions:        Initialize CAN, install CAN interrupt handler
**
** parameters:            bitrate
** Returned value:        true or false, false if initialization failed.
**
******************************************************************************/
void CAN_SetACCF_Lookup(void) {
    uint32_t address = 0;
    uint32_t i;
    uint32_t ID_high, ID_low;

    // Set explicit standard Frame
    SFF_sa = address;
    for (i = 0; i < ACCF_IDEN_NUM; i += 2) {
        ID_low = (i << 29) | (EXP_STD_ID << 16);
        ID_high = ((i + 1) << 13) | (EXP_STD_ID << 0);
        *((volatile uint32_t *)(CAN_MEM_BASE + address)) = ID_low | ID_high;
        address += 4;
    }

    // Set group standard Frame
    SFF_GRP_sa = address;
    for (i = 0; i < ACCF_IDEN_NUM; i += 2) {
        ID_low = (i << 29) | (GRP_STD_ID << 16);
        ID_high = ((i + 1) << 13) | (GRP_STD_ID << 0);
        *((volatile uint32_t *)(CAN_MEM_BASE + address)) = ID_low | ID_high;
        address += 4;
    }

    // Set explicit extended Frame
    EFF_sa = address;
    for (i = 0; i < ACCF_IDEN_NUM; i++) {
        ID_low = (i << 29) | (EXP_EXT_ID << 0);
        *((volatile uint32_t *)(CAN_MEM_BASE + address)) = ID_low;
        address += 4;
    }

    // Set group extended Frame
    EFF_GRP_sa = address;
    for (i = 0; i < ACCF_IDEN_NUM; i++) {
        ID_low = (i << 29) | (GRP_EXT_ID << 0);
        *((volatile uint32_t *)(CAN_MEM_BASE + address)) = ID_low;
        address += 4;
    }

