ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_CAN.cpp
    // Set End of Table
    ENDofTable = address;
    return;
}

/******************************************************************************
** Function name:        CAN_SetACCF
**
** Descriptions:        Set acceptance filter and SRAM associated with
**
** parameters:            ACMF mode
** Returned value:        None
**
**
******************************************************************************/
void CAN_SetACCF(uint32_t ACCFMode) {
    switch (ACCFMode) {
    case ACCF_OFF:
        AFMR = ACCFMode;
        C1MOD = C2MOD = 1;    // Reset CAN
        C1IER = C2IER = 0;    // Disable Receive Interrupt
        C1GSR = C2GSR = 0;    // Reset error counter when CANxMOD is in reset
        break;

    case ACCF_BYPASS:
        AFMR = ACCFMode;
        break;

    case ACCF_ON:
    case ACCF_FULLCAN:
        AFMR = ACCF_OFF;
        CAN_SetACCF_Lookup();
        AFMR = ACCFMode;
        break;

    default:
        break;
    }
    return;
}

bool InsertionSort2CheckOverlap(uint32_t *lowerBounds, uint32_t *upperBounds, int32_t length) {

    uint32_t i, j, tmp, tmp2;

    for (i = 1; i < length; i++) {
        j = i;

        while (j > 0 && lowerBounds[j - 1] > lowerBounds[j]) {
            tmp = lowerBounds[j]; tmp2 = upperBounds[j];
            lowerBounds[j] = lowerBounds[j - 1];    upperBounds[j] = upperBounds[j - 1];
            lowerBounds[j - 1] = tmp;    upperBounds[j - 1] = tmp2;

            j--;
        }
    }

    // check for overlap
    if (lowerBounds[0] > upperBounds[0])
        return false;

    for (i = 1; i < length; i++) {
        if (lowerBounds[i] > upperBounds[i])
            return false;

        if (lowerBounds[i] <= upperBounds[i - 1])
            return false;
    }

    return true;
}

int32_t BinarySearch(uint32_t *sortedArray, int32_t first, int32_t last, uint32_t key) {
    int32_t mid;
    while (first <= last) {
        mid = (first + last) / 2;  // compute mid point.
        if (key > sortedArray[mid])
            first = mid + 1;  // repeat search in top half.
        else if (key < sortedArray[mid])
            last = mid - 1; // repeat search in bottom half.
        else
            return mid;     // found it. return position /////
    }

    return -1;    // failed to find key
}

int32_t BinarySearch2(uint32_t *lowerBounds, uint32_t *upperBounds, int32_t first, int32_t last, uint32_t key) {

    int32_t mid;

    while (first <= last) {
        mid = (first + last) / 2;  // compute mid point.

        if (key > upperBounds[mid])
            first = mid + 1;  // repeat search in top half.
        else if (key < lowerBounds[mid])
            last = mid - 1; // repeat search in bottom half.
        else
            return mid;     // found it. return position /////
    }

    return -1;    // failed to find key
}

const char* canApiNames[] = {
#if TOTAL_CAN_CONTROLLERS > 0
"GHIElectronics.TinyCLR.NativeApis.LPC17.CanController\\0",
#if TOTAL_CAN_CONTROLLERS > 1
"GHIElectronics.TinyCLR.NativeApis.LPC17.CanController\\1"
#endif
#endif
};

void LPC17_Can_AddApi(const TinyCLR_Api_Manager* apiManager) {
    for (int32_t i = 0; i < TOTAL_CAN_CONTROLLERS; i++) {
        canControllers[i].ApiInfo = &canApi[i];
        canControllers[i].Acquire = &LPC17_Can_Acquire;
        canControllers[i].Release = &LPC17_Can_Release;
        canControllers[i].Enable = &LPC17_Can_Enable;
        canControllers[i].Disable = &LPC17_Can_Disable;
        canControllers[i].CanWriteMessage = &LPC17_Can_CanWriteMessage;
        canControllers[i].CanReadMessage = &LPC17_Can_CanReadMessage;
        canControllers[i].WriteMessage = &LPC17_Can_WriteMessage;
        canControllers[i].ReadMessage = &LPC17_Can_ReadMessage;
        canControllers[i].SetBitTiming = &LPC17_Can_SetBitTiming;
        canControllers[i].GetMessagesToRead = &LPC17_Can_GetMessagesToRead;
        canControllers[i].SetMessageReceivedHandler = &LPC17_Can_SetMessageReceivedHandler;
        canControllers[i].SetErrorReceivedHandler = &LPC17_Can_SetErrorReceivedHandler;
        canControllers[i].SetExplicitFilters = &LPC17_Can_SetExplicitFilters;
        canControllers[i].SetGroupFilters = &LPC17_Can_SetGroupFilters;
        canControllers[i].ClearReadBuffer = &LPC17_Can_ClearReadBuffer;
        canControllers[i].GetWriteErrorCount = &LPC17_Can_GetWriteErrorCount;
        canControllers[i].GetReadErrorCount = &LPC17_Can_GetReadErrorCount;
        canControllers[i].GetSourceClock = &LPC17_Can_GetSourceClock;
        canControllers[i].GetReadBufferSize = &LPC17_Can_GetReadBufferSize;
        canControllers[i].SetReadBufferSize = &LPC17_Can_SetReadBufferSize;
        canControllers[i].GetWriteBufferSize = &LPC17_Can_GetWriteBufferSize;
        canControllers[i].SetWriteBufferSize = &LPC17_Can_SetWriteBufferSize;

        canApi[i].Author = "GHI Electronics, LLC";
        canApi[i].Name = canApiNames[i];
        canApi[i].Type = TinyCLR_Api_Type::CanController;
        canApi[i].Version = 0;
        canApi[i].Implementation = &canControllers[i];
        canApi[i].State = &canStates[i];

        canStates[i].controllerIndex = i;

        apiManager->Add(apiManager, &canApi[i]);
    }
}

/******************************************************************************
** Function name:        CAN_ISR_Rx
**
** Descriptions:        CAN Rx1 interrupt handler
**
** parameters:            None
** Returned value:        None
**
******************************************************************************/
void CAN_ISR_Rx(int32_t controllerIndex) {
    auto state = &canStates[controllerIndex];

    // filter
    if (state->canDataFilter.groupFiltersSize || state->canDataFilter.matchFiltersSize) {
        uint32_t ID = controllerIndex == 0 ? C1RID : C2RID;

        char passed = 0;

        if (state->canDataFilter.groupFiltersSize) {
            if (BinarySearch2(state->canDataFilter.lowerBoundFilters, state->canDataFilter.upperBoundFilters, 0, state->canDataFilter.groupFiltersSize - 1, ID) >= 0)
                passed = 1;
        }

        if (!passed && state->canDataFilter.matchFiltersSize) {
            if (BinarySearch(state->canDataFilter.matchFilters, 0, state->canDataFilter.matchFiltersSize - 1, ID) >= 0)
                passed = 1;
        }

