ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_CAN.cpp
        if (!passed) {
            if (controllerIndex == 0)
                C1CMR = 0x04; // release receive buffer
            else
                C2CMR = 0x04; // release receive buffer
            return;
        }
    }

    if (state->can_rx_count > (state->can_rxBufferSize - 3)) {
        if (controllerIndex == 0)
            C1CMR = 0x04; // release receive buffer
        else
            C2CMR = 0x04; // release receive buffer

        state->errorEventHandler(state->provider, TinyCLR_Can_Error::BufferFull, LPC17_Time_GetCurrentProcessorTime());

        return;
    }

    // initialize destination pointer
    LPC17_Can_Message *can_msg = &state->canRxMessagesFifo[state->can_rx_in];

    // timestamp
    uint64_t t = LPC17_Time_GetCurrentProcessorTime();

    can_msg->timeStampL = t & 0xFFFFFFFF;
    can_msg->timeStampH = t >> 32;

    uint32_t flag;
    uint32_t dataA;
    uint32_t dataB;
    uint32_t msgId;

    if (controllerIndex == 0) {
        flag = C1RFS;  // Frame
        msgId = C1RID;
        dataA = C1RDA;
        dataB = C1RDB;
        C1CMR = 0x04; // release receive buffer
    }
    else {
        flag = C2RFS;  // Frame
        msgId = C2RID;
        dataA = C2RDA;
        dataB = C2RDB;
        C2CMR = 0x04; // release receive buffer
    }

    can_msg->length = (flag >> 16) & 0x0F;

    can_msg->extendedId = ((flag & 0x80000000) != 0) ? true : false;

    can_msg->remoteTransmissionRequest = ((flag & 0x40000000) != 0) ? true : false;

    can_msg->msgId = msgId; // ID

    can_msg->dataA = dataA; // Data A

    can_msg->dataB = dataB; // Data B

    state->can_rx_count++;
    state->can_rx_in++;

    if (state->can_rx_in == state->can_rxBufferSize) {
        state->can_rx_in = 0;
    }

    state->messageReceivedEventHandler(state->provider, state->can_rx_count, LPC17_Time_GetCurrentProcessorTime());
}
void LPC17_Can_RxInterruptHandler(void *param) {
    uint32_t status = CANRxSR;

    int32_t controllerIndex;

    DISABLE_INTERRUPTS_SCOPED(irq);

    if (status & (1 << 8)) {
        controllerIndex = 0;

        auto state = &canStates[controllerIndex];

        uint32_t c1 = CAN1ICR;

        CAN_ISR_Rx(controllerIndex);

        if (c1 & (1 << 3)) {
            state->errorEventHandler(state->provider, TinyCLR_Can_Error::Overrun, LPC17_Time_GetCurrentProcessorTime());
        }
        if (c1 & (1 << 5)) {
            state->errorEventHandler(state->provider, TinyCLR_Can_Error::Passive, LPC17_Time_GetCurrentProcessorTime());
        }
        if (c1 & (1 << 7)) {
            C1MOD = 1;    // Reset CAN
            state->errorEventHandler(state->provider, TinyCLR_Can_Error::BusOff, LPC17_Time_GetCurrentProcessorTime());
        }

    }
    if (status & (1 << 9)) {
        controllerIndex = 1;

        auto state = &canStates[controllerIndex];

        uint32_t c2 = CAN2ICR;

        CAN_ISR_Rx(controllerIndex);

        if (c2 & (1 << 3)) {
            state->errorEventHandler(state->provider, TinyCLR_Can_Error::Overrun, LPC17_Time_GetCurrentProcessorTime());
        }
        if (c2 & (1 << 5)) {
            state->errorEventHandler(state->provider, TinyCLR_Can_Error::Passive, LPC17_Time_GetCurrentProcessorTime());
        }
        if (c2 & (1 << 7)) {
            C2MOD = 1;    // Reset CAN
            state->errorEventHandler(state->provider, TinyCLR_Can_Error::BusOff, LPC17_Time_GetCurrentProcessorTime());
        }
    }
}

TinyCLR_Result LPC17_Can_Acquire(const TinyCLR_Can_Controller* self) {
    if (self == nullptr)
        return TinyCLR_Result::ArgumentNull;

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    if (state->initializeCount == 0) {
        auto controllerIndex = state->controllerIndex;

        if (!LPC17_GpioInternal_OpenMultiPins(canPins[controllerIndex], 2))
            return TinyCLR_Result::SharingViolation;

        // set pin as analog
        LPC17_GpioInternal_ConfigurePin(canPins[controllerIndex][CAN_TX_PIN].number, LPC17_Gpio_Direction::Input, canPins[controllerIndex][CAN_TX_PIN].pinFunction, LPC17_Gpio_ResistorMode::Inactive, LPC17_Gpio_Hysteresis::Disable, LPC17_Gpio_InputPolarity::NotInverted, LPC17_Gpio_SlewRate::StandardMode, LPC17_Gpio_OutputType::PushPull);
        LPC17_GpioInternal_ConfigurePin(canPins[controllerIndex][CAN_RX_PIN].number, LPC17_Gpio_Direction::Input, canPins[controllerIndex][CAN_RX_PIN].pinFunction, LPC17_Gpio_ResistorMode::Inactive, LPC17_Gpio_Hysteresis::Disable, LPC17_Gpio_InputPolarity::NotInverted, LPC17_Gpio_SlewRate::StandardMode, LPC17_Gpio_OutputType::PushPull);

        state->can_rx_count = 0;
        state->can_rx_in = 0;
        state->can_rx_out = 0;
        state->baudrate = 0;
        state->can_rxBufferSize = canDefaultBuffersSize[controllerIndex];
        state->provider = self;
        state->enable = false;

        state->canDataFilter.matchFiltersSize = 0;
        state->canDataFilter.groupFiltersSize = 0;

        state->canRxMessagesFifo = nullptr;

        if (controllerIndex == 0)
            LPC_SC->PCONP |= (1 << 13);    // Enable clock to the peripheral

        if (controllerIndex == 1)
            LPC_SC->PCONP |= (1 << 14);    // Enable clock to the peripheral

        CAN_SetACCF(ACCF_BYPASS);
    }

    state->initializeCount++;

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_Can_Release(const TinyCLR_Can_Controller* self) {
    if (self == nullptr)
        return TinyCLR_Result::ArgumentNull;

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    if (state->initializeCount == 0) return TinyCLR_Result::InvalidOperation;

    state->initializeCount--;

    if (state->initializeCount == 0) {
        auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);


        auto controllerIndex = state->controllerIndex;

        if (state->canRxMessagesFifo != nullptr) {
            memoryProvider->Free(memoryProvider, state->canRxMessagesFifo);

            state->canRxMessagesFifo = nullptr;
        }

        CAN_DisableExplicitFilters(controllerIndex);
        CAN_DisableGroupFilters(controllerIndex);

        LPC17_GpioInternal_ClosePin(canPins[controllerIndex][CAN_TX_PIN].number);
        LPC17_GpioInternal_ClosePin(canPins[controllerIndex][CAN_RX_PIN].number);
    }

