ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_CAN.cpp
    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_Can_SoftReset(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
    auto controllerIndex = state->controllerIndex;

    state->can_rx_count = 0;
    state->can_rx_in = 0;
    state->can_rx_out = 0;

    // Reset CAN
    if (controllerIndex == 0) {
        C1MOD = 1;    // Reset CAN
        C1IER = 0;    // Disable Receive Interrupt
        C1GSR = 0;    // Reset error counter when CANxMOD is in reset
        C1BTR = state->baudrate;
        C1MOD = 0x4;    // CAN in normal operation mode
        C1IER = 0x01 | (1 << 7) | (1 << 3) | (1 << 5);    // Enable receive interrupts
    }
    else {
        C2MOD = 1;    // Reset CAN
        C2IER = 0;    // Disable Receive Interrupt
        C2GSR = 0;    // Reset error counter when CANxMOD is in reset
        C2BTR = state->baudrate;
        C2MOD = 0x0;    // CAN in normal operation mode
        C2IER = 0x01 | (1 << 7) | (1 << 3) | (1 << 5);    // Enable receive interrupts
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_Can_WriteMessage(const TinyCLR_Can_Controller* self, const TinyCLR_Can_Message* messages, size_t& len) {
    if (len != 1) return TinyCLR_Result::NotSupported;

    auto& m = messages[0];
    uint32_t arbitrationId = m.ArbitrationId;
    bool isExtendedId = m.IsExtendedId;
    bool isRemoteTransmissionRequest = m.IsRemoteTransmissionRequest;
    const uint8_t* data = m.Data;
    size_t length = m.Length;

    uint32_t *data32 = (uint32_t*)data;

    uint32_t flags = 0;
    uint32_t status;

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
    auto controllerIndex = state->controllerIndex;

    if (isExtendedId)
        flags |= 0x80000000;

    if (isRemoteTransmissionRequest)
        flags |= 0x40000000;

    flags |= (length & 0x0F) << 16;

    uint32_t timeout = CAN_TRANSFER_TIMEOUT;

    while (LPC17_Can_CanWriteMessage(self) == false && timeout-- > 0) {
        LPC17_Time_Delay(nullptr, 1);
    }

    if (timeout == 0)
        return TinyCLR_Result::Busy;

    if (controllerIndex == 0) {
        status = C1SR;

        if (status & 0x00000004) {
            C1TFI1 = flags & 0xC00F0000;
            C1TID1 = arbitrationId;
            C1TDA1 = data32[0];
            C1TDB1 = data32[1];

            C1CMR = 0x21;

            return TinyCLR_Result::Success;
        }
    }
    else {
        status = C2SR;

        if (status & 0x00000004) {
            C2TFI1 = flags & 0xC00F0000;
            C2TID1 = arbitrationId;
            C2TDA1 = data32[0];
            C2TDB1 = data32[1];

            C2CMR = 0x21;

            return TinyCLR_Result::Success;
        }
    }

    return TinyCLR_Result::Busy;
}

TinyCLR_Result LPC17_Can_ReadMessage(const TinyCLR_Can_Controller* self, TinyCLR_Can_Message* messages, size_t& len) {
    if (len != 1) return TinyCLR_Result::NotSupported;

    auto& m = messages[0];
    uint32_t& arbitrationId = m.ArbitrationId;
    bool& isExtendedId = m.IsExtendedId;
    bool& isRemoteTransmissionRequest = m.IsRemoteTransmissionRequest;
    uint8_t* data = m.Data;
    size_t& length = m.Length;
    uint64_t& timestamp = m.Timestamp;

    LPC17_Can_Message *can_msg;

    uint32_t *data32 = (uint32_t*)data;

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    if (state->can_rx_count) {
        DISABLE_INTERRUPTS_SCOPED(irq);

        can_msg = &state->canRxMessagesFifo[state->can_rx_out];
        state->can_rx_out++;

        if (state->can_rx_out == state->can_rxBufferSize)
            state->can_rx_out = 0;

        state->can_rx_count--;

        arbitrationId = can_msg->msgId;
        isExtendedId = can_msg->extendedId;
        isRemoteTransmissionRequest = can_msg->remoteTransmissionRequest;

        data32[0] = can_msg->dataA;
        data32[1] = can_msg->dataB;

        length = can_msg->length;

        timestamp = ((uint64_t)can_msg->timeStampL) | ((uint64_t)can_msg->timeStampH << 32);
    }

    return TinyCLR_Result::Success;

}

TinyCLR_Result LPC17_Can_SetBitTiming(const TinyCLR_Can_Controller* self, const TinyCLR_Can_BitTiming* timing) {
    uint32_t propagation = timing->Propagation;
    uint32_t phase1 = timing->Phase1;
    uint32_t phase2 = timing->Phase2;
    uint32_t baudratePrescaler = timing->BaudratePrescaler;
    uint32_t synchronizationJumpWidth = timing->SynchronizationJumpWidth;
    bool useMultiBitSampling = timing->UseMultiBitSampling;

    LPC17xx_SYSCON &SYSCON = *(LPC17xx_SYSCON *)(size_t)(LPC17xx_SYSCON::c_SYSCON_Base);

    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
    auto controllerIndex = state->controllerIndex;

    if (state->canRxMessagesFifo == nullptr)
        state->canRxMessagesFifo = (LPC17_Can_Message*)memoryProvider->Allocate(memoryProvider, state->can_rxBufferSize * sizeof(LPC17_Can_Message));

    if (state->canRxMessagesFifo == nullptr) {
        return TinyCLR_Result::OutOfMemory;
    }

    state->baudrate = ((phase2 - 1) << 20) | ((phase1 - 1) << 16) | ((baudratePrescaler - 1) << 0);

    if (controllerIndex == 0) {
        SYSCON.PCLKSEL0 |= (1 << 26) | (1 << 30);//CAN1 CAN2 filter

        C1MOD = 1;    // Reset CAN
        C1IER = 0;    // Disable Receive Interrupt
        C1GSR = 0;    // Reset error counter when CANxMOD is in reset
        C1BTR = state->baudrate;
        C1MOD = 0x4;    // CAN in normal operation mode
        C1IER = 0x01 | (1 << 7) | (1 << 3) | (1 << 5);    // Enable receive interrupts
    }
    else {
        SYSCON.PCLKSEL0 |= (1 << 28) | (1 << 30);//CAN1 CAN2 filter

        C2MOD = 1;    // Reset CAN
        C2IER = 0;    // Disable Receive Interrupt
        C2GSR = 0;    // Reset error counter when CANxMOD is in reset
        C2BTR = state->baudrate;
        C2MOD = 0x0;    // CAN in normal operation mode
        C2IER = 0x01 | (1 << 3) | (1 << 5) | (1 << 7);        // Enable receive interrupts
    }

    LPC17_InterruptInternal_Activate(CAN_IRQn, (uint32_t*)&LPC17_Can_RxInterruptHandler, 0);

