ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_CAN.cpp
    return TinyCLR_Result::Success;
}

size_t LPC17_Can_GetMessagesToRead(const TinyCLR_Can_Controller* self) {

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    return state->can_rx_count;
}

TinyCLR_Result LPC17_Can_SetMessageReceivedHandler(const TinyCLR_Can_Controller* self, TinyCLR_Can_MessageReceivedHandler handler) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    state->messageReceivedEventHandler = handler;

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_Can_SetErrorReceivedHandler(const TinyCLR_Can_Controller* self, TinyCLR_Can_ErrorReceivedHandler handler) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    state->errorEventHandler = handler;

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_Can_SetExplicitFilters(const TinyCLR_Can_Controller* self, const uint32_t* filters, size_t count) {
    uint32_t *_matchFilters;

    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    _matchFilters = (uint32_t*)memoryProvider->Allocate(memoryProvider, count * sizeof(uint32_t));

    if (!_matchFilters)
        return TinyCLR_Result::OutOfMemory;

    memcpy(_matchFilters, filters, count * sizeof(uint32_t));

    std::sort(_matchFilters, _matchFilters + count);

    {
        DISABLE_INTERRUPTS_SCOPED(irq);

        auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
        auto controllerIndex = state->controllerIndex;

        CAN_DisableExplicitFilters(controllerIndex);

        state->canDataFilter.matchFiltersSize = count;
        state->canDataFilter.matchFilters = _matchFilters;
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_Can_SetGroupFilters(const TinyCLR_Can_Controller* self, const uint32_t* lowerBounds, const uint32_t* upperBounds, size_t count) {
    uint32_t *_lowerBoundFilters, *_upperBoundFilters;

    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    _lowerBoundFilters = (uint32_t*)memoryProvider->Allocate(memoryProvider, count * sizeof(uint32_t));

    if (!_lowerBoundFilters) {
        return  TinyCLR_Result::OutOfMemory;
    }

    _upperBoundFilters = (uint32_t*)memoryProvider->Allocate(memoryProvider, count * sizeof(uint32_t));

    if (!_upperBoundFilters) {
        memoryProvider->Free(memoryProvider, _lowerBoundFilters);

        return  TinyCLR_Result::OutOfMemory;
    }

    memcpy(_lowerBoundFilters, lowerBounds, count * sizeof(uint32_t));
    memcpy(_upperBoundFilters, upperBounds, count * sizeof(uint32_t));

    bool success = InsertionSort2CheckOverlap(_lowerBoundFilters, _upperBoundFilters, count);

    if (!success) {
        memoryProvider->Free(memoryProvider, _lowerBoundFilters);
        memoryProvider->Free(memoryProvider, _upperBoundFilters);

        return TinyCLR_Result::ArgumentInvalid;
    }

    {
        DISABLE_INTERRUPTS_SCOPED(irq);

        auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
        auto controllerIndex = state->controllerIndex;

        CAN_DisableGroupFilters(controllerIndex);

        state->canDataFilter.groupFiltersSize = count;
        state->canDataFilter.lowerBoundFilters = _lowerBoundFilters;
        state->canDataFilter.upperBoundFilters = _upperBoundFilters;
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_Can_ClearReadBuffer(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    state->can_rx_count = 0;
    state->can_rx_in = 0;
    state->can_rx_out = 0;

    return TinyCLR_Result::Success;
}

size_t LPC17_Can_GetReadErrorCount(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
    auto controllerIndex = state->controllerIndex;

    return controllerIndex == 0 ? ((C1GSR >> 16) & 0xFF) : ((C2GSR >> 16) & 0xFF);
}

size_t LPC17_Can_GetWriteErrorCount(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
    auto controllerIndex = state->controllerIndex;

    return controllerIndex == 0 ? (C1GSR >> 24) : (C2GSR >> 24);
}

uint32_t LPC17_Can_GetSourceClock(const TinyCLR_Can_Controller* self) {
    return LPC17_AHB_CLOCK_HZ / 2;
}

size_t LPC17_Can_GetReadBufferSize(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
    auto controllerIndex = state->controllerIndex;

    return state->can_rxBufferSize == 0 ? canDefaultBuffersSize[controllerIndex] : state->can_rxBufferSize;
}

TinyCLR_Result LPC17_Can_SetReadBufferSize(const TinyCLR_Can_Controller* self, size_t size) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
    auto controllerIndex = state->controllerIndex;

    if (size > 3) {
        state->can_rxBufferSize = size;
        return TinyCLR_Result::Success;
    }
    else {
        state->can_rxBufferSize = canDefaultBuffersSize[controllerIndex];
        return TinyCLR_Result::ArgumentInvalid;;
    }
}

size_t LPC17_Can_GetWriteBufferSize(const TinyCLR_Can_Controller* self) {
    return 1;
}

TinyCLR_Result LPC17_Can_SetWriteBufferSize(const TinyCLR_Can_Controller* self, size_t size) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    state->can_txBufferSize = 1;

    return size == 1 ? TinyCLR_Result::Success : TinyCLR_Result::NotSupported;
}

void LPC17_Can_Reset() {
    for (int i = 0; i < TOTAL_CAN_CONTROLLERS; i++) {
        canStates[i].canRxMessagesFifo = nullptr;

        LPC17_Can_Release(&canControllers[i]);

        canStates[i].initializeCount = 0;
    }
}

TinyCLR_Result LPC17_Can_Enable(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
    state->enable = true;

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_Can_Disable(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
    state->enable = false;

    return TinyCLR_Result::Success;
}

bool LPC17_Can_CanWriteMessage(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
    bool canWrite = false;

    auto controllerIndex = state->controllerIndex;

    uint32_t status = controllerIndex == 0 ? C1SR : C2SR;

    if ((status & 0x00000004) &&
        (status & 0x00000400) &&
        (status & 0x00040000)) {
        canWrite = true;
    }
    return (state->enable && canWrite);
}

bool LPC17_Can_CanReadMessage(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    return (state->enable);
}
#endif // INCLUDE_CAN
